Repository: zrr1999/rill
Catalog: Sources/RillUI/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# workflow.workflowWakePhrasesHint
source: Local listening is off by default. Prepare the selected local Qwen ASR in Voice settings before enabling this workflow.
zh_hans: 本地监听默认关闭；启用此工作流前，请先在语音设置中准备当前本地 Qwen ASR。

# workflow.workflowWakePhrasesLabel
source: Wake phrases
zh_hans: 唤醒短语

# workflow.workflowWakePhrasesPlaceholder
source: One phrase per line (1–4)
zh_hans: 每行一个短语（1–4 个）

# workflowActionResult.cancelled
source: Cancelled
zh_hans: 已取消

# workflowActionResult.copiedToClipboard
source: Copied
zh_hans: 已复制

# workflowActionResult.externalOutput
source: External output completed
zh_hans: 外部输出已完成

# workflowActionResult.failed
source: Failed
zh_hans: 失败

# workflowActionResult.injected
source: Inserted
zh_hans: 已输入

# workflowActionResult.skipped
source: Skipped
zh_hans: 已跳过

# workflowActionResult.storedRecord
source: Saved to Records
zh_hans: 已存入记录

# workflowConflict
source: Conflict: %1$@ is also enabled for %2$@.
zh_hans: 冲突：%1$@ 也被以下工作流启用了：%2$@。

# workflowDocument.labelDelete
source: Delete
zh_hans: 删除

# workflowDocument.labelDuplicate
source: Duplicate
zh_hans: 创建副本

# workflowDocument.labelEditExternally
source: Edit TOML and prompts in your text editor. Saved changes apply to the next run.
zh_hans: 在外部文本编辑器中修改 TOML 和提示词，保存后对下次运行生效。

# workflowDocument.labelEnabled
source: Enabled
zh_hans: 启用

# workflowDocument.labelImportTOML
source: Import TOML…
zh_hans: 导入 TOML…

# workflowDocument.labelInvalidFileNewRunsAreBlocked
source: Invalid TOML; new runs are blocked
zh_hans: TOML 无效，已阻止新运行

# workflowDocument.labelMoreActions
source: More actions
zh_hans: 更多操作

# workflowDocument.labelNewFrom
source: New from
zh_hans: 从模板新建：

# workflowDocument.labelNewWorkflow
source: New workflow
zh_hans: 新建工作流

# workflowDocument.labelOpenFile
source: Open file
zh_hans: 打开文件

# workflowDocument.labelOutputs
source: outputs
zh_hans: 个输出

# workflowDocument.labelPreset
source: Preset
zh_hans: 预设

# workflowDocument.labelReloadFiles
source: Reload files
zh_hans: 重新加载文件

# workflowDocument.labelRemove
source: Remove
zh_hans: 移除

# workflowDocument.labelRemoveThisCustomization
source: Remove this customization?
zh_hans: 移除此自定义配置？

# workflowDocument.labelRestoreDefault
source: Restore default
zh_hans: 恢复默认

# workflowDocument.labelRun
source: Run
zh_hans: 运行

# workflowDocument.labelRunClipboardText
source: Run clipboard text
zh_hans: 运行剪贴板文本

# workflowDocument.labelSearchWorkflows
source: Search workflows
zh_hans: 搜索工作流

# workflowDocument.labelShowConfigurationFolder
source: Show configuration folder
zh_hans: 打开配置目录

# workflowDocument.labelSteps
source: steps
zh_hans: 个步骤

# workflowDocument.labelWorkflowActions
source: Workflow actions
zh_hans: 工作流操作

# workflowDocument.labelWorkflows
source: Workflows
zh_hans: 工作流

# workflowEnableConflict
source: Cannot enable this workflow. %1$@ is already in use by %2$@.
zh_hans: 无法启用这个工作流。%1$@ 已被以下工作流占用：%2$@。

# workflowExplanationAvailability.available
source: Pipeline component available
zh_hans: 管线组件可用

# workflowExplanationAvailability.unavailable
source: Pipeline component unavailable
zh_hans: 管线组件不可用

# workflowExplanationAvailability.unclassified
source: Component availability unclassified
zh_hans: 组件可用性未分类

# workflowExplanationComponent.outputAction
source: Output
zh_hans: 输出

# workflowExplanationComponent.privacyPolicy
source: Privacy policy
zh_hans: 隐私策略

# workflowExplanationComponent.recognizer
source: Speech recognition
zh_hans: 语音识别

# workflowExplanationComponent.transformer
source: Transform
zh_hans: 处理步骤

# workflowExplanationComponent.workflow
source: Workflow
zh_hans: 工作流

# workflowExplanationConfiguration.configured
source: Configured
zh_hans: 已配置

# workflowExplanationConfiguration.invalid
source: Setup invalid
zh_hans: 配置无效

# workflowExplanationConfiguration.missing
source: Setup missing
zh_hans: 缺少配置

# workflowExplanationConfiguration.notRequired
source: No setup required
zh_hans: 无需配置

# workflowExplanationConfiguration.unclassified
source: Setup unclassified
zh_hans: 配置未分类

# workflowExplanationCopy.button
source: Explain before run
zh_hans: 运行前说明

# workflowExplanationCopy.close
source: Close
zh_hans: 关闭

# workflowExplanationCopy.destinations
source: Processing destinations
zh_hans: 处理位置

# workflowExplanationCopy.inputs
source: Inputs
zh_hans: 输入

# workflowExplanationCopy.invalidReceipt
source: The preview could not be verified and was rejected.
zh_hans: 无法验证预览结果，已拒绝展示。

# workflowExplanationCopy.issues
source: Current issues
zh_hans: 当前问题

# workflowExplanationCopy.loading
source: Checking the current privacy and routing conditions…
zh_hans: 正在检查当前隐私与路由条件…

# workflowExplanationCopy.none
source: None
zh_hans: 无

# workflowExplanationCopy.outputs
source: Output effects
zh_hans: 输出效果

# workflowExplanationCopy.previewNotice
source: This preview does not authorize a run. Rill checks privacy and routing conditions again at runtime.
zh_hans: 此预览不代表运行授权。Rill 会在实际运行时重新检查隐私与路由条件。

# workflowExplanationCopy.privacyConditions
source: Privacy conditions
zh_hans: 隐私条件

# workflowExplanationCopy.providerUnavailable
source: The current preview is unavailable. No workflow content was exposed.
zh_hans: 当前预览不可用，且未暴露任何工作流内容。

# workflowExplanationCopy.refresh
source: Refresh preview
zh_hans: 刷新预览

# workflowExplanationCopy.retry
source: Try again
zh_hans: 重试

# workflowExplanationCopy.saveBeforePreview
source: Save the visible changes before previewing this workflow.
zh_hans: 请先保存当前可见改动，再预览此工作流。

# workflowExplanationCopy.savedVersionNotice
source: The preview uses the saved workflow configuration.
zh_hans: 预览使用已保存的工作流配置。

# workflowExplanationCopy.sheetTitle
source: Current run preview
zh_hans: 当前运行预览

# workflowExplanationCopy.transforms
source: Transforms
zh_hans: 处理步骤

# workflowExplanationCopy.trigger
source: Trigger
zh_hans: 触发方式

# workflowExplanationCopy.workflowUnavailable
source: This workflow is no longer available.
zh_hans: 此工作流已不可用。

# workflowExplanationDestination.clipboard
source: Handed to the system clipboard; it may sync under system settings
zh_hans: 交给系统剪贴板；它可能按系统设置同步

# workflowExplanationDestination.cloudService
source: Cloud speech service
zh_hans: 云端语音服务

# workflowExplanationDestination.focusedApplication
source: Handed to the focused application; later behavior follows that application
zh_hans: 交给当前应用；后续行为取决于该应用

# workflowExplanationDestination.localAutomation
source: Handed to macOS automation; it may access the network, and this preview cannot prove it stays on this Mac
zh_hans: 交给 macOS 自动化；它可能访问网络，此预览无法证明数据仍留在本机

# workflowExplanationDestination.localFile
source: Handed to the configured file; it may sync, and this preview cannot prove it stays on this Mac
zh_hans: 交给已配置文件；它可能被同步，此预览无法证明数据仍留在本机

# workflowExplanationDestination.localStorage
source: Stored in Rill application storage
zh_hans: 保存到 Rill 应用存储

# workflowExplanationDestination.onDevice
source: Processed by Rill on this Mac
zh_hans: 由 Rill 在本机处理

# workflowExplanationDestination.remoteEndpoint
source: Remote endpoint
zh_hans: 远程端点

# workflowExplanationDestination.unclassified
source: Unclassified destination
zh_hans: 未分类位置

# workflowExplanationInput.clipboardText
source: Clipboard text
zh_hans: 剪贴板文本

# workflowExplanationInput.focusedSelection
source: Focused selection
zh_hans: 当前选区

# workflowExplanationInput.microphoneAudio
source: Microphone audio
zh_hans: 麦克风音频

# workflowExplanationInput.recognitionHints
source: Recognition hints
zh_hans: 识别提示词

# workflowExplanationInput.unclassified
source: Unclassified input
zh_hans: 未分类输入

# workflowExplanationIssueKind.componentUnavailable
source: A required pipeline component is unavailable.
zh_hans: 所需管线组件不可用。

# workflowExplanationIssueKind.componentUnclassified
source: A pipeline component is unclassified.
zh_hans: 管线组件尚未分类。

# workflowExplanationIssueKind.configurationInvalid
source: The setup is invalid.
zh_hans: 配置无效。

# workflowExplanationIssueKind.configurationMissing
source: Required setup is missing.
zh_hans: 缺少必需配置。

# workflowExplanationIssueKind.executionPlanUnresolved
source: The execution plan is unresolved.
zh_hans: 执行计划尚未解析。

# workflowExplanationIssueKind.legacyWorkflowUnsupported
source: This legacy workflow is unsupported.
zh_hans: 不支持此旧版工作流。

# workflowExplanationIssueKind.privacyConfirmationRequired
source: Runtime privacy confirmation is required.
zh_hans: 运行时需要隐私确认。

# workflowExplanationIssueKind.privacyEvaluationUnavailable
source: The privacy preview is unavailable.
zh_hans: 隐私预览不可用。

# workflowExplanationIssueKind.privacyInputRedacted
source: Sensitive input will be omitted.
zh_hans: 敏感输入将被省略。

# workflowExplanationIssueKind.privacyProcessingBlocked
source: Current privacy policy blocks processing.
zh_hans: 当前隐私策略阻止处理。

# workflowExplanationOutput.clipboardWrite
source: Write system clipboard
zh_hans: 写入系统剪贴板

# workflowExplanationOutput.fileAppend
source: Append local file
zh_hans: 追加本地文件

# workflowExplanationOutput.focusedApplicationWrite
source: Write focused application
zh_hans: 写入当前应用

# workflowExplanationOutput.recordStoreWrite
source: Save record
zh_hans: 保存记录

# workflowExplanationOutput.shortcutInvocation
source: Run Shortcut
zh_hans: 运行快捷指令

# workflowExplanationOutput.speechPlayback
source: Play speech
zh_hans: 播放语音

# workflowExplanationOutput.unclassified
source: Unclassified output
zh_hans: 未分类输出

# workflowExplanationOutput.webhookRequest
source: Send webhook request
zh_hans: 发送 Webhook 请求

# workflowExplanationPrivacyReason.autoGeneratedClipboard
source: The clipboard content was generated automatically.
zh_hans: 剪贴板内容由系统自动生成。

# workflowExplanationPrivacyReason.cloudConfirmationRequired
source: Rill will ask before cloud processing at runtime.
zh_hans: Rill 会在运行时进行云端处理前询问。

# workflowExplanationPrivacyReason.cloudProcessingBlocked
source: Current privacy policy blocks cloud processing.
zh_hans: 当前隐私策略阻止云端处理。

# workflowExplanationPrivacyReason.cloudProviderSelected
source: This plan includes cloud processing.
zh_hans: 此计划包含云端处理。

# workflowExplanationPrivacyReason.concealedClipboard
source: The clipboard content is concealed.
zh_hans: 剪贴板内容处于隐藏状态。

# workflowExplanationPrivacyReason.itemTaggedExcludeFromWorkflowCapture
source: The source item is marked to stay out of workflow capture.
zh_hans: 来源条目被标记为不参与工作流捕获。

# workflowExplanationPrivacyReason.privacySettingsUnavailable
source: Privacy settings are currently unavailable.
zh_hans: 隐私设置当前不可用。

# workflowExplanationPrivacyReason.processingDestinationUnavailable
source: A processing destination could not be classified.
zh_hans: 无法对某个处理位置进行分类。

# workflowExplanationPrivacyReason.secureInput
source: Secure Input limits context access.
zh_hans: 安全输入模式限制了上下文访问。

# workflowExplanationPrivacyReason.sensitiveApplication
source: The focused application is covered by a sensitive-app rule.
zh_hans: 当前应用命中了敏感应用规则。

# workflowExplanationPrivacyReason.transientClipboard
source: The clipboard content is transient.
zh_hans: 剪贴板内容是临时内容。

# workflowExplanationPrivacyReason.unknownFocusContext
source: The focused application could not be classified.
zh_hans: 无法对当前应用进行分类。

# workflowExplanationPrivacyReason.userDisabledClipboardHistory
source: Clipboard history is disabled by the user.
zh_hans: 用户已关闭剪贴板历史。

# workflowExplanationStatusDetail.blocked
source: The workflow cannot run under the current preview conditions. Review every issue below.
zh_hans: 当前预览条件下无法运行此工作流，请查看下方全部问题。

# workflowExplanationStatusDetail.ready
source: This is not a full readiness check. Runtime rechecks privacy, permissions, credentials, and destinations before execution.
zh_hans: 这不是完整的可运行性检查；实际执行前仍会重新检查隐私、权限、凭据与输出位置。

# workflowExplanationStatusDetail.requiresConfirmation
source: No prompt is shown while previewing. Rill will ask immediately before the run if still required.
zh_hans: 预览时不会弹窗；若运行时仍需确认，Rill 会在执行前询问。

# workflowExplanationStatusTitle.blocked
source: Blocked in this preview
zh_hans: 当前预览已阻止

# workflowExplanationStatusTitle.ready
source: Current privacy preview passed
zh_hans: 当前隐私预检已通过

# workflowExplanationStatusTitle.requiresConfirmation
source: Will ask at runtime
zh_hans: 运行时将询问

# workflowExplanationTransform.languageModelAnswer
source: Language-model answer
zh_hans: 语言模型回答

# workflowExplanationTransform.languageModelRewrite
source: Language-model rewrite
zh_hans: 语言模型改写

# workflowExplanationTransform.snippetReplacement
source: Snippet replacement
zh_hans: 片段替换

# workflowExplanationTransform.vocabularyMapping
source: Vocabulary mapping
zh_hans: 词汇映射

# workflowExplanationTransform.whitespaceNormalization
source: Whitespace normalization
zh_hans: 空白规范化

# workflowExplanationTrigger.hotkey
source: Hotkey
zh_hans: 快捷键

# workflowExplanationTrigger.manual
source: Manual
zh_hans: 手动

# workflowExplanationTrigger.menuBar
source: Menu bar
zh_hans: 菜单栏

# workflowExplanationTrigger.wakeWord
source: Wake word
zh_hans: 唤醒词

# workflowExplanationUsage.conditional
source: Conditional
zh_hans: 按条件使用

# workflowExplanationUsage.required
source: Required
zh_hans: 必需

# workflowExplanationUsage.unclassified
source: Usage unclassified
zh_hans: 用途未分类

# workflowName.ambiguousDemoStack
source: Guided Capture
zh_hans: 确认后保存

# workflowName.cleanInput
source: Clean Input
zh_hans: 干净输入

# workflowName.cloudDictation
source: Cloud Dictation
zh_hans: 云端听写

# workflowName.commandMode
source: Command Mode
zh_hans: 命令模式

# workflowName.directDemoClipboard
source: Capture Selection
zh_hans: 收进剪贴板组

# workflowName.formalWriting
source: Formal Writing
zh_hans: 正式写作

# workflowName.localDictation
source: Local Dictation
zh_hans: 本地听写

# workflowName.pushToTalkCapture
source: Accurate Transcription
zh_hans: 精准转写

# workflowName.pushToTalkPolish
source: Transcription + LLM Rewrite (Planned)
zh_hans: 转写 + 大模型润色（待办）

# workflowName.rawInput
source: Raw Input
zh_hans: 原样输入

# workflowName.recordDelivery
source: Record Delivery
zh_hans: 记录投递

# workflowName.rewriteDemoStack
source: Polish Draft
zh_hans: 润色成稿

# workflowName.smartCleanup
source: Smart Cleanup
zh_hans: 智能整理

# workflowName.speechRecognition
source: Speech Recognition
zh_hans: 语音识别

# workflowName.streamingInput
source: Streaming Direct
zh_hans: 流式直出

# workflowName.translateInput
source: Translate Input
zh_hans: 翻译输入

# workflowName.voiceAssistant
source: Voice Assistant
zh_hans: 语音助手

# workflowRunSkipReason.allActionsSkipped
source: All actions were skipped
zh_hans: 所有动作均已跳过

# workflowRunSkipReason.busy
source: Rill is busy
zh_hans: Rill 正忙

# workflowRunSkipReason.conditionFailed
source: Trigger condition did not match
zh_hans: 触发条件不匹配

# workflowRunSkipReason.eventKindMismatch
source: Event type did not match
zh_hans: 事件类型不匹配

# workflowRunSkipReason.excludedByCaptureTag
source: Excluded by capture tag
zh_hans: 已被捕获标签排除

# workflowRunSkipReason.loopPrevented
source: Automation loop prevented
zh_hans: 已阻止自动化循环

# workflowRunSkipReason.privacyBlocked
source: Blocked by privacy settings
zh_hans: 已被隐私设置阻止

# workflowRunSkipReason.recordChanged
source: Record changed before it could run
zh_hans: 记录在运行前已发生变化

# workflowRunSkipReason.recordMissing
source: Record is no longer available
zh_hans: 记录已不可用

# workflowRunSkipReason.sourceCollectionMismatch
source: Source collection did not match
zh_hans: 来源记录集不匹配

# workflowRunSkipReason.unclassified
source: Skip reason is unavailable
zh_hans: 跳过原因不可用

# workflowRunSkipReason.unsupported
source: Workflow is not supported
zh_hans: 当前不支持此工作流

# workflowRunSkipReason.workflowDisabled
source: Workflow is disabled
zh_hans: 工作流已停用

# workspace.allRecords
source: All Records
zh_hans: 全部记录

# workspace.allSources
source: All sources
zh_hans: 所有来源

# workspace.allTypes
source: All types
zh_hans: 所有类型

# workspace.collectionSettings
source: Collection Settings
zh_hans: 集合设置

# workspace.collections
source: Collections
zh_hans: 记录集

# workspace.contextMemory
source: Context Correction & Memory
zh_hans: 上下文纠错与记忆

# workspace.contextMemorySummary
source: Correct recognition with optional context and manage long-term memories.
zh_hans: 使用可选上下文纠正识别错误，并管理长期记忆。

# workspace.copy
source: Copy
zh_hans: 复制

# workspace.data
source: Data
zh_hans: 数据

# workspace.diagnosticsSummary
source: Inspect runtime status, storage issues and diagnostics.
zh_hans: 查看运行状态、存储问题和诊断信息。

# workspace.done
source: Done
zh_hans: 完成

# workspace.general
source: General
zh_hans: 常规

# workspace.input
source: Input
zh_hans: 输入

# workspace.loadMore
source: Show more results
zh_hans: 显示更多结果

# workspace.privacy
source: Privacy
zh_hans: 隐私

# workspace.recordRules
source: Capture & Delivery Rules
zh_hans: 采集与投递规则

# workspace.recordUnavailable
source: This record is no longer available.
zh_hans: 这条记录已不可用。

# workspace.records
source: Records
zh_hans: 记录

# workspace.recordsSearching
source: Searching records…
zh_hans: 正在搜索记录…

# workspace.recordsUnavailable
source: Records could not be searched. Other results are still available.
zh_hans: 无法搜索记录，其他结果仍可使用。

# workspace.searchEverywhere
source: Search records, runs, workflows and settings
zh_hans: 搜索记录、运行、工作流和设置

# workspace.searchRill
source: Search Rill
zh_hans: 搜索 Rill

# workspace.selectWorkflow
source: Select a workflow
zh_hans: 选择工作流

# workspace.showDetails
source: Show details
zh_hans: 查看详情

# workspace.source
source: Source
zh_hans: 来源

# workspace.vocabularyMemory
source: Vocabulary & Memory
zh_hans: 词汇与记忆

# workspace.voiceModels
source: Voice & Models
zh_hans: 语音与模型
